{
    "Registro añadido del oficial de comunicación: Encontramos indicios sobre la presencia de otras flotas de expedición.": 1,
    "Registro añadido del oficial de comunicación: Establecimos contacto amistoso por radio con algunas otras expediciones en el sector.": 1,
    "Registro añadido del oficial de comunicación: Celebramos la finalización de la expedición con los miembros de la tripulación de otra flota de expedición que estaba en camino en el mismo sector. Ellos tampoco tienen nada emocionante que informar.": 1,
    "Entrada do diário dos Engenheiros de Comunicações: Parece que esta parte do universo ainda não foi explorada.": 0,
    "Entrada do diário dos Engenheiros de Comunicações: É estranho saber que somos os primeiros a entrar neste sector.": 0,
    "Entrada do diário dos Engenheiros de Comunicações: Encontramos os destroços de algumas naves antigas. Não somos os primeiros neste quadrante.": 1,
    "Entrada do diário dos Engenheiros de Comunicações: Quase que chocamos contra uma outra frota em expedição. Pensei que não iríamos encontrar mais ninguém por aqui.": 2,
    "Entrada do diário dos Engenheiros de Comunicações: Ao que parece, somos os primeiros humanos a entrar nesta parte da galáxia.": 0,
    "Rapporto dell`ufficiale alle comunicazioni: Abbiamo stabilito un amichevole contatto radio con altre spedizioni in questo settore.": 2,
    "Rapporto dell`ufficiale alle comunicazioni: Abbiamo trovato prove che indicano la presenza di molte altre flotte di esplorazione in questo settore.": 2,
    "Rapporto dell`ufficiale alle comunicazioni: Abbiamo celebrato la riuscita dell`esplorazione con l`equipaggio di un`altra spedizione, anch`essa in missione in quel settore. Non avevano nulla di emozionante da raccontare.": 2,
    "Logboek van de communicatieofficier: Deze sector lijkt nog niet eerder verkend te zijn.": 0,
    "Logboek van de communicatieofficier: Het voelt altijd heerlijk als je een van de eersten bent die ooit een sector binnen vliegt.": 0,
    "Logboek van de communicatieofficier: Onverwacht komen we puin van oude schepen tegen, iemand is hier eerder geweest.": 1,
    "Logboek bijlage van de communicatieofficier: Op een haar na hadden we een botsing met een andere expeditie. Ik had niet verwacht hier andere schepen tegen te zullen komen.": 1,
    "Logboek van de communicatieofficier: Het lijkt er op dat geen mens ooit in deze uithoek van de melkweg is geweest.": 0,
    "Registro del diario de navegación del oficial de comunicación: Es una gran sensación ser el primero en un sector inexplorado.": 0,
    "Registro en el diario de navegación del oficial de comunicación: Parece como si esta parte del universo no hubiera sido explorada hasta ahora.": 0,
    "Registro añadido del oficial de comunicación: Encontramos antiguos signos de naves espaciales. Por tanto, no somos los primeros.": 1,
    "Registro añadido del oficial de comunicación: Casi tuvimos una colisión con otra flota de expedición. No pensé que también otros se anden por aquí.": 1,
    "Registro en el diario del oficial de comunicación: Parece como si ningún humano hubiera estado antes en esta parte de la galaxia.": 0,
    "Znaleźliśmy dowód wskazujący na obecność wielu innych flot ekspedycyjnych.": 2,
    "Rapporto dell`ufficiale alle comunicazioni: Sembra che nessun umano sia stato in questa parte della galassia.": 0,
    "Rapporto dell`ufficiale alle comunicazioni: Sembra che questa parte di universo non sia ancora stata esplorata.": 0,
    "Rapporto dell`ufficiale alle comunicazioni: E` emozionante essere i primi ad attraversare un settore inesplorato.": 0,
    "Rapporto dell`ufficiale alle comunicazioni: abbiamo quasi avut una collisione con un`altra flotta in spedizione. Non pensavo che ci sarebbe stato qualcun altro qui.": 1,
    "Rapporto dell`ufficiale alle comunicazioni: Abbiamo trovato i detriti di un`antica nave spaziale. Non siamo i primi ad essere stati qui.": 1,
    "Izvadak iz dnevnika oficira za komunikaciju: Našli smo dokaz da ima još ekspedicijskih flota prisutnih ovdije.": 2,
    "Izvadak iz dnevnika oficira za komunikaciju: Susreli smo članove druge ekspedicijske flote. Nisu nam rekli ništa korisno.": 2,
    "Wpis z dziennika pokładowego oficera komunikacyjnego: niemalże doszło do kolizji z flotą innej ekspedycji. Nie sądziłem, że inne ekspedycje mogą znajdować się w pobliżu.": 1,
    "Wpis z dziennika pokładowego oficerów komunikacyjnych: Zdaje się, że żaden człowiek jeszcze nie był w tej części galaktyki.": 0,
    "Wpis z dziennika pokładowego oficerów komunikacyjnych: znaleźliśmy szczątki starożytnego statku kosmicznego. Nie jesteśmy zatem pierwsi w tym miejscu.": 1,
    "Izvadak iz dnevnika oficira za komunikaciju: Susreli smo članove druge ekspedicijske flote. Nisu nam rekli nita korisno.": 1,
    "Izvadak iz dnevnika oficira za komunikaciju: Nali smo dokaz da ima jo ekspedicijskih flota prisutnih ovdije.": 1,
    "Izvadak iz dnevnika oficira za komunikaciju: Izgleda da ovaj dio univerzuma nije jo istraen.": 0,
    "Izvadak iz dnevnika oficira za komunikaciju: Uspostavili smo prijateljski kontakt sa drugom ekspedicijskom flotom.": 1,
    "Izvadak iz dnevnika oficira za komunikaciju: Izvandredan je osjećaj putovati dijelom sektora koji jo nije istraen.": 0,
    "Izvadak iz dnevnika oficira za komunikaciju: Nali smo ostatke prastarih svemirskih brodova. Netko je bio ovdje prije nas.": 1,
    "Wpis z dziennika pokładowego oficerów komunikacyjnych: to cudowne uczucie być pierwszymi, którzy podróżują przez ten niezbadany sektor.": 0,
    "Wpis z dziennika pokładowego oficerów komunikacyjnych: Zdaje się, że ta część wszechświata jeszcze nie była badana.": 0,
    "Logbuchnachtrag des Kommunikationsoffiziers: Es scheint nicht so, als ob jemals ein Mensch in diesem Bereich der Galaxis gewesen wäre.": 0,
    "Logbuchnachtrag des Kommunikationsoffiziers: Es wurden sehr alte Signaturen von Raumschiffen entdeckt. Wir sind also nicht die Ersten hier.": 1,
    "Logbuchnachtrag des Kommunikationsoffiziers: Wir hatten beinahe eine Kollision mit einer anderen Expeditionsflotte. Hätte nicht gedacht, dass sich hier noch andere herumtreiben.": 1,
    "Logbuchnachtrag des Kommunikationsoffiziers: Es ist ein erhebendes Gefühl, der Erste in einem unerforschten Sektor zu sein.": 0,
    "Logbuchnachtrag des Kommunikationsoffiziers: Dieser Bereich des Universums ist wohl noch nicht erkundet worden.": 0,
    "Extrait du journal de bord d`un officier de communication : Il semblerait que personne ne soit jamais venu jusqu`à ce coin reculé de la galaxie.": 0,
    "Izvadak iz dnevnika oficira za komunikaciju: Izgleda da nijedan čovjek nije bio u ovom dijelu galaksije prije nas.": "0",
    "Izvadak iz dnevnika oficira za komunikaciju: Izgleda da ovaj dio univerzuma nije još istražen.": "0",
    "Izvadak iz dnevnika oficira za komunikaciju: Izvandredan je osjećaj putovati dijelom sektora koji još nije istražen.": "0",
    "Izvadak iz dnevnika oficira za komunikaciju: Našli smo ostatke prastarih svemirskih brodova. Netko je bio ovdje prije nas.": 1,
    "Izvadak iz dnevnika oficira za komunikaciju: Skoro smo se susreli sa drugom ekspedicijskom flotom. Nisam očekivao da bi nekoga moglo biti ovdje.": 1,
    "Záznam z lodního deníku obsluhy komunikace: Nalezli jsme trosky prastarých vesmírných lodí. Nedostali jsme se sem první.": "1",
    "Záznam z lodního deníku obsluhy komunikace: Zdá se, že v části této galaxie ještě nikdo jiný před námi nebyl.": "0",
    "Záznam z lodního deníku obsluhy komunikace: Je to skvělý pocit poprvé prolétat neprozkoumaným sektorem.": "0",
    "Dodatek k lodnímu deníku obsluhy komunikace: Málem jsme se srazili s cizí expediční letkou. Nemyslel jsem, že se tu ještě s někým potkáme.": "1",
    "Záznam z lodního deníku obsluhy komunikace: Zdá se, že tato část vesmíru nebyla zatím prozkoumána.": "0",
    "Extrait du journal de bord d`un officier de communication : Nous avons découvert de très vieilles traces d`autres vaisseaux, nous ne sommes donc pas les premiers à venir ici.": 1,
    "Extrait du journal de bord d`un officier de communication : Nous avons failli entrer en collision avec une autre flotte d`expédition. Je ne pensais pas qu`il y avait d`autres expéditions qui traînaient par ici.": 1,
    "Entry from the communications officers logbook: It seems that no human has been in this part of the galaxy before.": 0,
    "Logbook addition of the communication officer: We nearly had a collision with another expedition fleet. I did not believe that there would be others around here.": 1,
    "Extrait du journal de bord d`un officier de communication : C`est un sentiment assez unique de se savoir le premier à explorer ce coin perdu de la galaxie.": 0,
    "Entry from the communications officers logbook: It feels great to be the first ones traveling through an unexplored sector.": 0,
    "Entry from the communications officers logbook: It seems that this part of the universe has not been explored yet.": 0,
    "Entry from the communications officers logbook: We found debris of ancient space ships. We are not the first ones here.": 1,
    "Extrait du journal de bord d`un officier de communication : Cette partie de l`univers n`a apparemment encore jamais été explorée.": 0
}