import { LifeformDiscoveryEventArtifactFindingSize } from "@/shared/models/lifeform-discoveries/LifeformDiscoveryEventArtifactFindingSize";
import { LifeformDiscoveryEventType } from "@/shared/models/lifeform-discoveries/LifeformDiscoveryEventType";
import { LifeformDiscoveryMessages } from "./types";

export const zh_tw: LifeformDiscoveryMessages = {
    [LifeformDiscoveryEventType.nothing]: [
        /*'在探索之初，*/'他們破譯了從神秘資訊'/* ，從中獲得了一些很有希望的座標。但當探索飛船到達座標提到的區域時，船員們發現，那只是一場戰鬥後留下的巨大殘骸。搜尋倖存者的行動最終也毫無結果。'*/,
        '小行星磁場干擾了掃描器'/* 。看似有希望的外星智慧生命信號，其實只是測量儀器的中斷信號；因此，船員們並沒有發現新的生命形式。'*/,
        /*'在探索飛船截獲了一個很有希望的無線電信號之後，*/'他們所有的通信系統突然癱瘓了'/* 。在這種情況下，不僅不可能與潛在的智慧生命形式取得聯繫，而且，繼續這項任務也會很危險。所以船員們失望地返航，但大家都沒有受傷。'*/,
        /*'在我們系統的一個大部分未探索過的角落裡，發現了一*/'個具有某種意識形式的星雲我'/* 們的星際使節欣喜若狂；當探測器被送入星雲中時，媒體甚至引起了嚴重的騷動。然而，試圖與星雲交流的嘗試很快揭示，它的智慧程度甚至還不如一隻蟑螂。人們激動的情緒消退了，並且決定悄悄地把整個事件掩蓋起來。'*/,
        /*'為了尋找新的生命形式，探索飛船追蹤了一些神秘的信號；這些信號似乎來自一*/'個未知星球的遠端'/* 。飛船上的星際使節已經取回了問候包，並啟動了翻譯電腦，但結果發現信號來自一艘沉船。這艘船顯然來自域外星球，但不幸的是，已經沒有船員的跡象。這意味著沒有發現新的生命形式。'*/,
        /*'探索飛船已經飛行了一段時間，後來發現一*/'個致命的漏洞溜進了掃描軟體'/* 。不幸的是，這意味著，船員無法發現新的生命形式。'*/,
        /*'我們的星際使節拜訪了一*/'顆居住著非常乾淨的類蟲物種的行星'/* ；他們認為這些物種一定擁有智慧，但結果令人感到失望。在看到它們瘋搶飛船垃圾壓縮器裡的東西後，他們決定把它們送回它們的星球，儘管一些船員建議留一些在飛船上。'*/,
        /*'探索飛船上的研究人員欣喜若狂地發現，*/'小行星群中央有一個神經網路'/* 。然而，他們發現這不過是截獲新聞報導的裝置；對此，他們頗感失望；並且，內容是關於幾個世紀前的體育比賽結果；但是，這個裝置已經發展出了自身的生命，就像某種太空沙發專家一樣。船員們失望地返航；除了一些毫無意義的資訊外，他們並沒有得到任何更重要的消息。'*/,
        '對真菌孢子的測試結果表明'/* ，他們發現了智慧生命；探索飛船上的船員們欣喜若狂。但是，結果證明，這是某個小丑操縱了測試結果；其目的只是為了讓競爭對手難堪。實際上，這些孢子並不會比那些在廚房微波爐後面發現的孢子更聰明多少。在飛船返航之前，他們把這個搞事的傢伙扔在了最近的行星上。'*/,
        /*'這些看似有希望的外星智慧生命信號將探索飛船到達一個獨自漂浮在太*/'空深處的神秘金色球體'/* 。儘管飛船上的星際使節盡了一切努力，他們還是無法在這個奇怪的物體找到入口，也無法與之進行任何形式的接觸；然後，這個球體突然跳躍離開了'*/,
        /*'在一顆未探索過的行星上，探索飛船發現了一個植物系統；它們展現出比最初出現時更高的智慧。然而，當工作人員試圖調查時，*/'穿著奇怪制服的警衛機器人出現了'/* ，並警告他們這些植物是私人財產。研究人員下定決心，冒著違反星系侵入法的風險，在黑暗的掩護下進行了一次秘密行動，提取了一些樣本，然後快速進入軌道。遺憾的是，對於一群研究人員來說，這項行動顯然有點太隱蔽了；回到船上後，他們發現，他們冒險獲得的樣本只不過是普通的室內植物。'*/,
        /*'在他們尋找外星智慧生物的過程中，探索飛船在銀河系中漫無目的地搜尋了幾個月的時間，但是，他們最終發現了一*/'種外星的草履蟲'/* ！它並不完全符合智慧生命的標準，但是，在經歷這麼長時間單調乏味的搜索後，船員們認為，即使這種愚蠢生命的發現也是卓有成效的；所以，他們沒有獲得任何有價值的好消息，只能選擇返航。'*/,
        /*'探索船追蹤到一個極有希望的信號，但不幸的是，*/'該信號在宇宙迷霧中消失了'/* 。他們繼續尋找了一段時間，依然沒有發現任何新的生命形式。'*/,
        /*'經過仔細搜索只有，探索飛船的船員發現了一*/'種發光的巨型變形蟲'/* ！遺憾的是，這種單細胞生物無法通過標準智力測試。考慮到研究人員對變形蟲幾乎不怎麼關注，毫無疑問，這個發現同樣會被認為無關緊要。'*/,
        /*'探險飛船的全體船員都被一團催眠霧的魔力所吸引。奇怪的顏色和設計似乎在某種程度上干擾了人類的大腦；這意味著，船員不再思考尋找外星生命，而是在思考：*/'外星人真的吃綠色熱狗嗎'/* ？當然，他們沒有發現任何新的生命形式。'*/,
        /*'在尋找外星生命的過程中，*/'探索飛船曾陷入宇宙漩渦'/* ，外層船體嚴重受損。船員和飛船在一次危險的飛行機動中獲救，但他們不得不放棄探險，空手而歸。'*/,
        /*'探索飛船發現了一個古老的廢棄空間站；*/'其上曾經有一些以前不為人知的物種居住'/* 。然而，更深入的研究發現，該空間站只是一種已滅絕的生命形式精心設計的騙局。船員們銷毀了這些可笑的資訊，但沒有發現其他值得注意的東西。'*/,
        /*'在一個孤獨和野蠻的星球上，船員們發現了一*/'個高科技人工智慧驅動的研究站'/* 。不幸的是，研究站的門有密碼保護，且該人工智慧拒絕配合。船員們花了幾天時間試圖破譯密碼；給養物資不斷減少；幸好一名比較不顯眼的船員偶然發現了密碼，然後破譯了密碼。但是，這個工作站最終令人大失所望：這個人工智慧只不過是一個精心設計的家庭管理系統。船員們決定返航。'*/,
        /*'導航模組中的一個技術錯誤使探索飛船接近一*/'個黑洞的視界'/* ，陷入極度危險之中。船員及時返航，但最終耗盡了燃料供應，因此不得不停止尋找新的生命形式，無功而返。'*/,
        /*'探索飛船興奮地報告說，他們遇到了一*/'艘來自平行宇宙的'/* 一模一樣的飛船。這個維度的宇航員甚至有著相同的名字。但相似之處僅限於此：在歡迎派對上，客人們太粗魯了；所以船員們很快就把他們趕出了我們的宇宙。船員們深感失望，同時也鬆了一口氣，然後返航回家了。'*/,
    ],
    [LifeformDiscoveryEventType.lostShip]: [
        '叛變者已經控制了飛船'/*，並加入了一個太空海盜團夥。由於這一事件，所有船員現在都必須每季度參加強制性的團隊建設研討會。'*/,
        /*'探索飛船上的船員成功與一*/'個以前不為人知的外星物種取得了聯繫'/* 。第一印象表示，它們是仁慈的物種。但是我們的使節和船員提交的報告變得越來越興奮，所以。我們必須假設他們受到了某種催眠。我們收到的最後報告是代表全體船員發出的歡慶公告，表示他們更願意和這些友好的外星人待在一起。然後，整艘飛船及船員消失得無影無蹤。'*/,
        /*'在尋找智慧生命形式的過程中，飛船在一顆之前未探索過的衛星上停了下來。至少，該衛星從未報告過。但是，其中原因很快就水落石出了。船員們設法發出了求救信號，但為時已晚。*/'巨大的岩漿蠕蟲被飛船的到來喚醒'/* ，並在幾分鐘內吞噬了飛船和船員。'*/,
        /*'探索非常設法追蹤到一個智慧外星物種，*/'但結果發現它們持敵對態度'/* 。從船員發出的最後一個信號來看，外星人好像把船員當成囚犯帶走了。每次嘗試進一步定位這艘飛船和船員都以失敗告終。'*/,
        /*'在旅途中，探索飛船在一顆未知的星球停了下來，以儲備給養。這顆行星籠罩在一層奇怪的迷霧中，*/'宇航員很快就識別出這是睡氣'/* 。但經過進一步檢查，很快就發現氣體太強烈了，飛船和船員都無法自救。'*/,
        /*'這艘探險飛船上的船員頗有特立獨行的名聲；他們甚至勇敢到了魯莽的程度；因此，他們看起來是這次任務的完美選擇。*/'也許他們認為他們可以直接穿過小行星群'/* ？不幸的是，我們很難從他們的船隻殘骸中拼湊出我們所需的答案。'*/,
        /*'看來探索飛船已經在一*/'個迄今未知的奇點中失蹤了'/* 。此後，再也沒有探測到船員生命跡象。'*/,
        /*'探索飛船飛進了一*/'個好戰的外星物種設下的埋伏之中'/* 。在建立初步聯繫之前，它們就徹底摧毀了這艘探索飛船。'*/,
        /*'探險飛船檢測到一些非常有值得探索的信號。但在找到信號源後，*/'它突然停止了信號發射'/* 。搜索小隊已派出，但無法找到任何艦船的位置和跡象。對方肯定消失在虛空之中了。'*/,
        /*'這艘飛船的領航員一定是太專注於跟蹤那個奇怪的信號了，所以忘記他們正在一*/'個黑洞附近作業'/* 。這艘飛船距離引力井太近了，儘管船員們盡了最大的努力，還是無法阻止被吸進去的命運。為了避免更多這種不必要的損失，該報告建議，自動黑洞警報將在未來作為飛船的標準配置。'*/
    ],
    [LifeformDiscoveryEventType.newLifeformFound]: /.+；以添加至生命形式選單/i,
    [LifeformDiscoveryEventType.knownLifeformFound]: /我們的使節能夠透過(?<xp>\d+) 經驗值加深對它們的了解/i,
    [LifeformDiscoveryEventType.artifacts]: {
        size: {
            [LifeformDiscoveryEventArtifactFindingSize.storageFull]: /*'探索飛船已找到寶物，*/'但無法取回寶物，因為您的儲存空間已滿',
            [LifeformDiscoveryEventArtifactFindingSize.small]: '探索飛船找到了少量的寶物',
            [LifeformDiscoveryEventArtifactFindingSize.medium]: '探索飛船已找到大量寶物',
            [LifeformDiscoveryEventArtifactFindingSize.large]: '個巨大的寶物庫',
        },
        numberOfArtifacts: /已找到寶物：(?<artifacts>\d+)/i,
    },
};